; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport two-cities-sequential-3nodes-1000size-4degree-100mindistance-3trucks-2packages-63seed

(define (problem transport-two-cities-sequential-3nodes-1000size-4degree-100mindistance-3trucks-2packages-63seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  truck-1 - vehicle
  truck-2 - vehicle
  truck-3 - vehicle
  package-1 - package
  package-2 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 301,952 -> 455,454
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 53)
  ; 455,454 -> 301,952
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 53)
  ; 931,259 -> 455,454
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 52)
  ; 455,454 -> 931,259
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 52)
  ; 2089,395 -> 2495,675
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 50)
  ; 2495,675 -> 2089,395
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 50)
  ; 2767,80 -> 2495,675
  (road city-2-loc-3 city-2-loc-1)
  (= (road-length city-2-loc-3 city-2-loc-1) 66)
  ; 2495,675 -> 2767,80
  (road city-2-loc-1 city-2-loc-3)
  (= (road-length city-2-loc-1 city-2-loc-3) 66)
  ; 2767,80 -> 2089,395
  (road city-2-loc-3 city-2-loc-2)
  (= (road-length city-2-loc-3 city-2-loc-2) 75)
  ; 2089,395 -> 2767,80
  (road city-2-loc-2 city-2-loc-3)
  (= (road-length city-2-loc-2 city-2-loc-3) 75)
  ; 931,259 <-> 2089,395
  (road city-1-loc-3 city-2-loc-2)
  (= (road-length city-1-loc-3 city-2-loc-2) 117)
  (road city-2-loc-2 city-1-loc-3)
  (= (road-length city-2-loc-2 city-1-loc-3) 117)
  (at package-1 city-1-loc-1)
  (at package-2 city-1-loc-3)
  (at truck-1 city-2-loc-1)
  (capacity truck-1 capacity-3)
  (at truck-2 city-2-loc-1)
  (capacity truck-2 capacity-4)
  (at truck-3 city-2-loc-2)
  (capacity truck-3 capacity-4)
 )
 (:goal (and
  (at package-1 city-2-loc-3)
  (at package-2 city-2-loc-1)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-3 city-2-loc-2 city-1-loc-3)
   deleted: (at truck-3 city-2-loc-2)
   added: (at truck-3 city-1-loc-3)
   goals met: 0 of 2
2. (pick-up truck-3 city-1-loc-3 package-2 capacity-3 capacity-4)
   deleted: (at package-2 city-1-loc-3) (capacity truck-3 capacity-4)
   added: (in package-2 truck-3) (capacity truck-3 capacity-3)
   goals met: 0 of 2
3. (drive truck-3 city-1-loc-3 city-1-loc-1)
   deleted: (at truck-3 city-1-loc-3)
   added: (at truck-3 city-1-loc-1)
   goals met: 0 of 2
4. (pick-up truck-3 city-1-loc-1 package-1 capacity-2 capacity-3)
   deleted: (at package-1 city-1-loc-1) (capacity truck-3 capacity-3)
   added: (in package-1 truck-3) (capacity truck-3 capacity-2)
   goals met: 0 of 2
5. (drive truck-3 city-1-loc-1 city-1-loc-3)
   deleted: (at truck-3 city-1-loc-1)
   added: (at truck-3 city-1-loc-3)
   goals met: 0 of 2
6. (drive truck-3 city-1-loc-3 city-2-loc-2)
   deleted: (at truck-3 city-1-loc-3)
   added: (at truck-3 city-2-loc-2)
   goals met: 0 of 2
7. (drive truck-3 city-2-loc-2 city-2-loc-1)
   deleted: (at truck-3 city-2-loc-2)
   added: (at truck-3 city-2-loc-1)
   goals met: 0 of 2
8. (drop truck-3 city-2-loc-1 package-2 capacity-2 capacity-3)
   deleted: (in package-2 truck-3) (capacity truck-3 capacity-2)
   added: (at package-2 city-2-loc-1) (capacity truck-3 capacity-3)
   goals met: 1 of 2
9. (drive truck-3 city-2-loc-1 city-2-loc-3)
   deleted: (at truck-3 city-2-loc-1)
   added: (at truck-3 city-2-loc-3)
   goals met: 1 of 2
10. (drop truck-3 city-2-loc-3 package-1 capacity-3 capacity-4)
   deleted: (in package-1 truck-3) (capacity truck-3 capacity-3)
   added: (at package-1 city-2-loc-3) (capacity truck-3 capacity-4)
   goals met: 2 of 2
